Repository: worku404/Online-Shop
Catalog: myshop/locale/*/LC_MESSAGES/django.po
Languages: am

source: Quantity
am: ብዛት

source: Your shopping cart
am: የእርስዎ ዕቃዎች ዘንቢል

source: Image
am: ምስል

source: Product
am: ምርት

source: Remove
am: አስወግድ

source: Unit price
am: የነጠላ ዋጋ

source: Price
am: ዋጋ

source: Update
am: አዘምን

source: Subtotal
am: ንዑስ ድምር

source: "%(code)s" coupon (%(discount)s%% off)
am: "%(code)s" ኩፖን (%(discount)s%% ቅናሽ)

source: Total
am: ጠቅላላ

source: People who bought this also bought
am: ይህንን የገዙ ሰዎች እነዚህንም ገዝተዋል

source: Apply a coupon
am: ኩፖን ይጠቀሙ

source: Apply
am: ተግብር

source: Continue shopping
am: ግብይት ይቀጥሉ

source: Checkout
am: ሒሳብ መክፈያ

source: Coupon
am: ኩፖን

source: English
am: እንግሊዝኛ

source: Spanish
am: ስፓኒሽ

source: Amharic
am: አማርኛ

source: cart/
am: ዘንቢል/

source: orders/
am: ትዕዛዞች/

source: payment/
am: ክፍያ/

source: coupons/
am: ኩፖን/

source: Payment canceled
am: ክፍያ ተሰርዟል

source: Your payment has not been processed
am: ክፍያዎ አልተፈጸመም

source: There was a problem processing your payment.
am: ክፍያዎን በማከናወን ላይ ችግር አጋጥሟል።

source: Payment successful
am: ክፍያ ተሳክቷል

source: Your payment was successful
am: ክፍያዎ ተሳክቷል

source: Your payment has been processed successfully.
am: ክፍያዎ በተሳካ ሁኔታ ተከናውኗል።

source: Pay your order
am: ለግዢዎ ይክፈሉ

source: Order summary
am: የግዢ ማጠቃለያ

source: "%(code)s" (%(discount)s%% off)
am: "%(code)s" (%(discount)s%% ቅናሽ)

source: Pay now
am: አሁን ይክፈሉ

source: process/
am: ክንውን/

source: completed/
am: ተጠናቀቀ/

source: canceled/
am: ተሰርዟል/

source: My shop
am: የእኔ ሱቅ

source: Your cart
am: የእርስዎ ዘንቢል

source: %(items)s item, $%(total)s
am: %(items)s ዕቃ, $%(total)s

source: Your cart is empty.
am: ዘንቢልዎ ባዶ ነው።

source: Add to cart
am: ወደ ዘንቢል ጨምር

source: Products
am: ምርቶች

source: Categories
am: ምድቦች

source: All
am: ሁሉም
